tsung_logs/testing/login_viewpost_logout/test1/tsung_logs/20211127-0107/tsung_posts_final.xml
<?xml version="1.0"?><tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="1000" use_controller_vm="true"/>
  </clients>

  <servers>
    <server host="avani.eba-fz2dfqnp.us-west-2.elasticbeanstalk.com" port="80" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="5" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="5" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="5" unit="second">
      <users arrivalrate="4" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="4" duration="5" unit="second">
      <users arrivalrate="8" unit="second"/>
    </arrivalphase>
  </load>

  <options>
    <option name="global_ack_timeout" value="2000"/>
  </options>

  <sessions>
    <session name="CreateNewPost" type="ts_http" weight="1">

    <request>
        <dyn_variable name="authenticity_token"/>
        <http url="/d/users/sign_in/" version="1.1" method="GET"/>
    </request>

    <thinktime value="2" random="true"/>

    <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="random_num"/>
    </setdynvars>

    <request subst="true">
        <http url="/d/users/sign_in/" version="1.1" method="POST" content_type="application/x-www-form-urlencoded" contents="authenticity_token=%%_authenticity_token%%&amp;user%5Bemail%5D=user_%%_random_num%%%40gmail.com&amp;user%5Bpassword%5D=Password1234&amp;user%5Bremember_me%5D=0&amp;commit=Log+in">
        </http>
    </request>

      <request><http method="GET" url="/posts/"/></request>





    <request>
        <dyn_variable name="users_profile_authenticity_token_logout" xpath="//head/meta[@name='csrf-token']/@content"/>
        <http url="/users/profile" version="1.1" method="GET"/>
    </request>

    <request subst="true">
        <http url="/d/users/sign_out" version="1.1" method="POST" content_type="application/x-www-form-urlencoded" contents="_method=delete&amp;authenticity_token=%%_users_profile_authenticity_token_logout%%">
        </http>
    </request>

    </session>
  </sessions>
</tsung>